{
  "CorruptTheSpire:FragmentOfCorruption": {
    "NAME": "Fragment of Corruption",
    "DESCRIPTIONS": [
      "As you wander the corrupted passages of the Spire, you notice a small piece of #bSpirestone that's broken off from the wall. It looks like the combination of #pcorruption and #bSpirestone has #gcrystallized. NL NL Doesn't look like there's any danger to touching it, so you scoop it up as you pass by."
    ],
    "OPTIONS": [
      "[Continue] Gain a {0} and continue on."
    ]
  },
  "CorruptTheSpire:TheChoice": {
    "NAME": "The Choice",
    "DESCRIPTIONS": [
      "TODO",
      "TODO embrace text",
      "TODO reject text"
    ],
    "OPTIONS": [
      "[Embrace] TODO",
      "[Reject] TODO",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:NightmareBloom": {
    "NAME": "Nightmare Bloom",
    "DESCRIPTIONS": [
      "As you cross an area of deep corruption within the Spire, your nightmares suddenly begin to feel very... #p~real...~. NL NL Fantasies of #gpower and #bskill surround you. NL You see now. The power could be yours. What do you reach out and seize?",
      "A minor exchange. NL NL As the visions dissipate, you feel a faint... disappointment. You could have had so much more.",
      "Might and mastery fill you. NL NL The corruption around you beckons you forward, and in its swirls and tendrils, there is satisfaction.",
      "The deal is made. You will purchase power, and gold will arm and armor you. NL NL Let the corruption grow. You will reap it for wealth and glory."
    ],
    "OPTIONS": [
      "[Earthly Goods] #gObtain {0}. #pGain #p{1} #pCorruption.",
      "[Heroic Power] #gUpgrade #gall #gCards. #pGain #p{0} #pCorruption.",
      "[Grand Wealth] #gGain #g{0} #gGold. #pGain #p{1} #pCorruption.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:MindsEye": {
    "NAME": "Mind's Eye",
    "DESCRIPTIONS": [
      "Your thoughts turn inward, and the Spire disappears as you explore your own #bmind. Strange, shimmering #gideas bubble up from within, reflecting back and forth in your mind's eye. NL NL You could be doing everything so very differently, you're sure of it. You strain your mind, feeling that an #gepiphany lies just beyond these phantasms....",
      "Of course. The countless ascents. Different bodies, yet one spirit. NL NL Come from below. Rise unto the heights, descend again with knowledge.",
      "You close your mind to the ideas. You won't be tricked. Your mind is a fortress."
    ],
    "OPTIONS": [
      "[Epiphany] #gGain {0}.",
      "[Reject] #gGain {0}.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:AStepToTheSide": {
    "NAME": "A Step to the Side",
    "DESCRIPTIONS": [
      "~Confused,~ you look around. Smoke drifts through the air. You're not sure how you got here.... NL NL A voice focuses your attention. \"Oh ho, a visitor. And by the looks of it, another one from that #bSpire.\" An old woman stands before you, tools of fortune telling in her hands. NL NL \"Nothing can change the #pfate you're yoked to, my dear, but perhaps I can ease you on your way.\" What do you ask for?",
      "The woman hands you a #gdeck #gof #gcards. \"There, a guide to aid you, only slightly #pcursed. Don't worry, it's a gift. I have other decks, and many other devices besides. Concern yourself with your own fate, climbing that #bSpire.\" NL NL You blink, and the woman fades away. The twisting passages of the #bSpire surround you, warped and alien. You begin to climb once more....",
      "A single card is all the woman lays out. A #ywheel, with figures surrounding it. You can't see the name of the card through the smoke. NL NL As you step forward to take a closer look, everything fades away. NL NL What just happened? You shake the fog from your thoughts and pick up the small pile of #ygold in front of you before continuing."
    ],
    "OPTIONS": [
      "[The Deck] #gGain {0}. #rBecome #rCursed #r- #rgoes #raway #rin #r{1} #rcombats.",
      "[A Drawing] #gGain #g{0} #gGold.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Wheel": {
    "NAME": "Wheel",
    "DESCRIPTIONS": [
      "Seeing a #ycard in front of you, you stop in your tracks. You can't pinpoint why, but something is familiar about it. NL NL Perhaps you've seen it before... or will see it, or were someone who saw it, or will be someone who sees it. NL NL The longer you try to think about it, the more your head #rhurts. But if you believe that somewhere out there, someone is sympathetic to your quest, this card might be a #gboon.",
      "You touch the card. For a moment, there are more directions to the world than normal. You see #ryourself and #gyourself and #byourself and #pyourself, and know that even that is only a small part of the whole. NL NL Vision or hallucination? You aren't sure. You take the card with you, hoping that its power will smooth your path.",
      "You resist the temptation to touch the card. You will win free of this place using your own power."
    ],
    "OPTIONS": [
      "[Touch the Card] #gGain {0}.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Divergence": {
    "NAME": "Divergence",
    "DESCRIPTIONS": [
      "The #bSpire is quiet around you. For once, nothing threatening seems to be nearby. NL NL This is a perfect opportunity to engage in self-study and training improve your strength in combat. There are two ways you could approach this: #gfocus on what you already know and build on it, or #gbroaden your horizons in search of something new and different.",
      "The technique fits well with what you already know.",
      "How do you know all these strange things anyway? Do you learn them or... remember them?"
    ],
    "OPTIONS": [
      "[Focus] #gChoose #g1 #gof #g{0} #gcards #gto #gadd #gto #gyour #gdeck.",
      "[Broaden] #gChoose #g1 #gof #g{0} #gcards #gof #gany #gcolor #gto #gadd #gto #gyour #gdeck.",
      "[Leave]",
      "Add a card to your deck."
    ]
  }
}