{
  "CorruptTheSpire:FragmentOfCorruption": {
    "NAME": "Fragment of Corruption",
    "DESCRIPTIONS": [
      "As you wander the corrupted passages of the Spire, you notice a small piece of #bSpirestone that's broken off from the wall. It looks like the combination of #pcorruption and #bSpirestone has #gcrystallized. NL NL Doesn't look like there's any danger to touching it, so you scoop it up as you pass by."
    ],
    "OPTIONS": [
      "[Continue] Gain a {0} and continue on."
    ]
  },
  "CorruptTheSpire:TheChoice": {
    "NAME": "The Choice",
    "DESCRIPTIONS": [
      "A crossroads. A #yfigure, cloaked. It beckons to you. NL NL The corruption within you urges you onward, promises you life, power, the world. You need only embrace it.",
      "The #yfigure murmurs with satisfaction as the #pcorruption surges within and around you. It hums through your #rveins, in #gharmony with the song of the #bSpire's corruption. How foolish it would be to deny yourself this power.",
      "The #yfigure advances, hissing and angry. The #pcorruption will not be thwarted so easily. If the siren's song does not suffice, perhaps force will. NL NL Reaching within yourself, knowing more is needed, you take the part of yourself that the phantasm seeks to seduce and #r@rip@ it out. NL NL The phantasm wails as you stand firm and resolute before it. It has no power over you now, and you stride forward, leaving it behind."
    ],
    "OPTIONS": [
      "[Embrace] #gGain #ga #grelic #gand #gupgrade #g{0} #grandom #gcards. #rGain #r{1} #rCorruption.",
      "[Reject] #gReduce #gCorruption #gby #g{0}. #rLose {1}.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:NightmareBloom": {
    "NAME": "Nightmare Bloom",
    "DESCRIPTIONS": [
      "As you cross an area of deep corruption within the Spire, your nightmares suddenly begin to feel very... #p~real....~ NL NL Fantasies of #gpower and #bskill surround you. NL You see now. The power could be yours. What do you reach out and seize?",
      "A minor exchange. NL NL As the visions dissipate, you feel a faint... disappointment. You could have had so much more.",
      "Might and mastery fill you. NL NL The corruption around you beckons you forward, and in its swirls and tendrils, there is satisfaction.",
      "The deal is made. You will purchase power, and gold will arm and armor you. NL NL Let the corruption grow. You will reap it for wealth and glory."
    ],
    "OPTIONS": [
      "[Earthly Goods] #gObtain {0}. #rGain #r{1} #rCorruption.",
      "[Heroic Power] #gUpgrade #gall #gCards. #rGain #r{0} #rCorruption.",
      "[Grand Wealth] #gGain #g{0} #gGold. #rGain #r{1} #rCorruption.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:MindsEye": {
    "NAME": "Mind's Eye",
    "DESCRIPTIONS": [
      "Your thoughts turn inward, and the Spire disappears as you explore your own #bmind. Strange, shimmering #gideas bubble up from within, reflecting back and forth in your mind's eye. NL NL You could be doing everything so very differently, you're sure of it. You strain your mind, feeling that an #gepiphany lies just beyond these phantasms....",
      "Of course. The countless ascents. Different bodies, yet one spirit. NL NL Come from below. Rise unto the heights, descend again with knowledge.",
      "You close your mind to the ideas. You won't be tricked. You are a fortress."
    ],
    "OPTIONS": [
      "[Epiphany] #gGain {0}.",
      "[Reject] #gGain #g{0} #gMax #gHP.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:AStepToTheSide": {
    "NAME": "A Step to the Side",
    "DESCRIPTIONS": [
      "~Confused,~ you look around. Smoke drifts through the air. You're not sure how you got here.... NL NL A voice focuses your attention. \"Oh ho, a visitor. And by the looks of it, another one from that #bSpire.\" An old woman stands before you, tools of fortune telling in her hands. NL NL \"Nothing can change the #pfate you're yoked to, my dear, but perhaps I can ease you on your way.\" What do you ask for?",
      "The woman hands you a #gdeck #gof #gcards. \"There, a guide to aid you, only slightly #pcursed. Don't worry, it's a gift. I have other decks, and many other devices besides. Concern yourself with your own fate, climbing that #bSpire.\" NL NL You blink, and the woman fades away. The twisting passages of the #bSpire surround you, warped and alien. You begin to climb once more....",
      "A single card is all the woman lays out. A #ywheel, with figures surrounding it. You can't see the name of the card through the smoke. NL NL As you step forward to take a closer look, everything fades away. NL NL What just happened? You shake the fog from your thoughts and pick up the small pile of #ygold in front of you before continuing."
    ],
    "OPTIONS": [
      "[The Deck] #gGain {0}. #rBecome #rCursed #r- #rFated.",
      "[A Reading] #gGain #g{0} #gGold.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Wheel": {
    "NAME": "Wheel",
    "DESCRIPTIONS": [
      "Seeing a #ycard in front of you, you stop in your tracks. You can't pinpoint why, but something is familiar about it. NL NL Perhaps you've seen it before... or will see it, or were someone who saw it, or will be someone who sees it. NL NL The longer you try to think about it, the more your head #rhurts. But if you believe that somewhere out there, someone is sympathetic to your quest, this card might be a #gboon.",
      "You touch the card. For a moment, there are more directions to the world than normal. You see #ryourself and #gyourself and #byourself and #pyourself, and know that even that is only a small part of the whole. NL NL Vision or hallucination? You aren't sure. You take the card with you, hoping that its power will smooth your path.",
      "Things are not always as they seem. You reach ~beyond~ the card you see, past the boundaries of this #bSpire, and in that tangled place you feel another card. Pulling it out, you examine it. NL NL A truth as real as the #ywheel. For every ending, a new beginning. Even in this #paccursed cycle, #ghope and #gjoy can be found.",
      "You resist the temptation to touch the card. You will win free of this place using your own power."
    ],
    "OPTIONS": [
      "[Touch the Card] #gGain {0}. #gGain #g{1} #gMax #gHP.",
      "[Reach Beyond] #gGain {0}. #rLose #r{1} #rMax #rHP.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Divergence": {
    "NAME": "Divergence",
    "DESCRIPTIONS": [
      "The #bSpire is quiet around you. For once, nothing threatening seems to be nearby. NL NL This is a perfect opportunity to engage in self-study and training improve your strength in combat. There are two ways you could approach this: #gfocus on what you already know and build on it, or #gbroaden your horizons in search of something new and different.",
      "The technique fits well with what you already know.",
      "How do you know all these strange things anyway? Do you learn them or... remember them?"
    ],
    "OPTIONS": [
      "[Focus] #gChoose #g1 #gof #g{0} #gcards #gto #gadd #gto #gyour #gdeck.",
      "[Broaden] #gChoose #g1 #gof #g{0} #gcards #gof #gany #gcolor #gto #gadd #gto #gyour #gdeck.",
      "[Leave]",
      "Add a card to your deck."
    ]
  },
  "CorruptTheSpire:PathsInTheSmoke": {
    "NAME": "Paths in the Smoke",
    "DESCRIPTIONS": [
      "#pThick #pblack #psmoke billows all around you, coming from an unseen source. In front of you, the thick strands of smoke fuse into a masked form. NL NL ~\"You~ aren't supposed to be ~here.~ If you keep wandering around untethered like this, you'll disrupt @everything.@ Neow needs to keep a tighter #rleash.\" NL NL \"I'll send you on your way, and I'll even let you choose where you end up. Just go, ~quickly.\"~",
      "At the figures gesture, three paths materialize from the smoke. Each one leads to an interesting location in the Spire. You step onto the path towards...."
    ],
    "OPTIONS": [
      "[Continue]"
    ]
  },
  "CorruptTheSpire:IncantationOfCorruption": {
    "NAME": "Incantation of Corruption",
    "DESCRIPTIONS": [
      "Examining a scroll you found, you sense that it holds the power of #r~chaos~ and #r~corruption.~ From the runes and diagrams, using the scroll will give you some of that power. NL NL The cost, or downside, seems to only be that using the power it gives is likely to further increase the #rcorruption.",
      "You speak the incantation to trigger the scroll, and a #proiling #pmass #pof #pshadows surrounds you, consuming and replacing your armor. The power it brings with it is... #rdelightful. NL NL\tYou will fight corruption with corruption. Victory is all that matters.",
      "Rather than make use of the scroll, you drain its energy. It's not much, but after absorbing all of it, you feel more #grobust."
    ],
    "OPTIONS": [
      "[Use] #gTransform #gyour #gDefends #ginto #gcorrupted #gcards.",
      "[Disenchant] #gGain #g{0} #gMax #gHP.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:StrangeMarketplace": {
    "NAME": "Strange Marketplace",
    "DESCRIPTIONS": [
      "Between one step and the next, you find yourself on the edges of a #gmarketplace, shrouded in shadows and dust. All sorts of mundane and magical goods are being sold, though the offerings are a bit #pstrange compared to what you're used to. NL NL Browsing, you find something that looks like quite a #ybargain. Another nearby stall is offering #bfree #bsamples of some unusual looking potions.",
      "You hand over your #ygold and take the relic, and with your next step you find yourself in the #bSpire once more."
    ],
    "OPTIONS": [
      "[Buy] #gGain {0}. #rLose #r{1} #rGold.",
      "[Sample] #gGain #g{0} #gcorrupted #gpotions.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:TreeOfSwords": {
    "NAME": "Tree of Swords",
    "DESCRIPTIONS": [
      "You stand before a tree with many weapons driven into its trunk and the ground around it. Alongside the weapons, you see the long-dead remains of what must be previous adventurers. They either came here to die, or were brought here. NL NL Some of the #bequipment here could come in handy, you see what might be a #grelic, and there are many #ycoins scattered about.",
      "You take armor and weaponry from the fallen warriors, leaving some of your own behind in tribute. You know they would accept the trade if their spirits could speak. After all, you and they share the same doomed quest.",
      "It looks like two fallen warriors were put to rest in the same spot here. Out of the remnants of their power, a relic formed as their bequest to the next to attempt this climb. Respectfully, you take the relic, leaving behind your own memento.",
      "You gather up all the coins. It's hard to avoid all the sharp weapons around them, though, so you get cut a few times."
    ],
    "OPTIONS": [
      "[Equipment] #gTransform #g{0} #gcards #ginto #gcards #gof #gany #gcolor.",
      "[Relic] #gGain {0}. #rLose {1}.",
      "[Coins] #gGain #g{0} #gGold. #rLose #r{1} #rHP.",
      "[Leave]",
      "Select Cards to Transform."
    ]
  },
  "CorruptTheSpire:WithoutBeginningOrEnd": {
    "NAME": "Without Beginning or End",
    "DESCRIPTIONS": [
      "Ahead of you, you see a figure approach a #gjeweled #yidol on a platform. Suddenly, a trap door opens and a boulder rolls out! But something nudges the boulder out of the way, and the figure escapes unharmed, with the idol.",
      "You approach a #gjeweled #yidol on a platform. Suddenly, a trap door opens and a boulder rolls out! But something nudges the boulder out of the way, and you escape unharmed, with the idol.",
      "Behind you, you see a figure approach a #gjeweled #yidol on a platform. Suddenly, a trap door opens and a boulder rolls out! You could throw the idol you have in your hands to nudge the boulder out of the way, but you'd lose the idol, and you're certain you could sell it.",
      "You throw the  idol to nudge the boulder out of the way, and the figure escapes unharmed, with the idol. NL NL You spend the next few minutes thinking about how to apply that as a #bcombat #bmaneuver.",
      "You ignore the boulder and quickly sell the #gjeweled #yidol to a passing trader. Somehow, you feel that was #runwise."
    ],
    "OPTIONS": [
      "[Throw] #gGain #g{0} {1}.",
      "[Turn Away] #gGain #g{0} #gGold. #rBecome #rCursed #r- #rFated.",
      "[Continue]",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:UnderAStrangeSky": {
    "NAME": "Under a Strange Sky",
    "DESCRIPTIONS": [
      "Suddenly terrible cold and an unfamiliar sky assail you. Seeking shelter, you enter the ice-covered structure in front of you. It appears to be ancient and abandoned, with little inside except more ice. NL NL The only intact thing you find is a shield, #gshimmering as it hangs on a high wall. Nearby is an old #rfire #rpit that you could get going again and rest next to. And in the depths, far enough down that it looks even colder than the rest of this place, you see a faint #yglint that might be a valuable relic.",
      "After a careful climb, you reach the #gshield. You feel its energy flow into you as you take it; the cold of this place no longer feels as harsh.",
      "You rest by the #rfire you created. In the coals, you find some #punusual #pfragments that you decide to take with you.",
      "The depths are #b~terribly~ #b~cold.~ The #yrelic is where you thought it was, but you can feel the chill in your bones. There will be a #rprice #rto #rpay for this."
    ],
    "OPTIONS": [
      "[Shield] #gGain {0}. #gGain #g{1} #gMax #gHP.",
      "[Fire Pit] #gGain #g{0} {1}. #gHeal #g{2} #gHP.",
      "[Depths] #gGain #ga #grelic. #rLose #r{0} #rMax #rHP.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:TreasureWardens": {
    "NAME": "Treasure Wardens",
    "DESCRIPTIONS": [
      "The flying beasts hiss in warning as you approach. This isn't what you were expecting.... NL NL They seem to be guarding the treasure. If you want it, you're in for a dangerous fight. Or you could leave, empty-handed.",
      "Better not to risk it. Those fangs and claws look fierce, and who knows what kind of deadly abilities they might have?"
    ],
    "OPTIONS": [
      "[Fight] An elite fight with extra rewards.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:SealedChest": {
    "NAME": "Sealed Chest",
    "DESCRIPTIONS": [
      "There's something unusual about this chest. It looks magnificent, large enough to contain more treasure than any chest you've ever seen. But the seals surrounding it tell you that treasure isn't the only thing inside. Whatever is sealed inside will be released if you open the chest.",
      "As you open the chest, a wave of energy pours out! You shiver as it passes through you and flows further into the Spire. It awaits you, another trial to overcome before your quest is complete.",
      "You decide to leave the chest alone."
    ],
    "OPTIONS": [
      "[Open] #gExtra #grewards! #rFight #ra #rspecial #radditional #ract #r3 #rboss.",
      "[Loot] Take your rewards.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Harbinger": {
    "NAME": "Harbinger",
    "DESCRIPTIONS": [
      "You come across an otherworldly monster, just emerged from a portal. Its gaze lands on you, eyes glinting with malicious intelligence, arcane energy suffusing its body. NL NL Fight or flight?",
      "The monster's laughter follows you as you flee."
    ],
    "OPTIONS": [
      "[Fight] An elite fight with extra rewards.",
      "[Flee]",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Devourer": {
    "NAME": "Devourer",
    "DESCRIPTIONS": [
      "You come across a group of bizarre creatures, feeding on a recent kill. The eyeless maws turn towards you, salivating in hunger, and the large one seems to grin in anticipation. NL Eat or be eaten?",
      "The monsters' shrieking cries follow you as you flee."
    ],
    "OPTIONS": [
      "[Eat] An elite fight with extra rewards.",
      "[Don't be eaten]",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Doom": {
    "NAME": "Doom",
    "DESCRIPTIONS": [
      "You come across a monstrous demon, causing decay from its presence. The creature drifts towards you and you feel the malevolent aura grow stronger. NL NL Confront your fate or evade it?",
      "The monster's unearthly gaze follows you as you flee."
    ],
    "OPTIONS": [
      "[Confront] An elite fight with extra rewards.",
      "[Evade]",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:TheDevice": {
    "NAME": "The Device",
    "DESCRIPTIONS": [
      "You examine the #bmassive #bdevice that you found along your path. There's a core powering it, and a great deal of masterfully crafted metalwork, but you barely recognize anything. Your best guess is that it operates a kind of magical seal, sealing away some #rdreadful #rmonster in a faraway place. NL NL As you puzzle over the device, you realize that it's power core has a lot of #ygold #ywiring. And the energy flowing through it is #ppowerful and #pdifferent. You could just... reach in there.",
      "Surely nothing #r~immediately~ bad will happen if you take the gold? By the time trouble comes, you'll be long gone. You hope....",
      "As you loot the core of the device, it flickers and stutters, clearly weakening as you make off with your ill-gotten gains.",
      "Whatever the device is doing, it's probably better for the world if it continues. Still, that #ygold would have been nice."
    ],
    "OPTIONS": [
      "[Continue]",
      "[Take] #gGain #g{0} #gGold #gand #g{1} #gcorrupted #gcards. #rFight #ra #rspecial #radditional #ract #r3 #rboss.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:SinisterTemple": {
    "NAME": "Sinister Temple",
    "DESCRIPTIONS": [
      "A gloom-shrouded temple greets you as you turn the corner, floating ~ominously~ above the ground. Climbing up to get a better look, at the center of the temple platform is an altar, and upon the altar is a relic, secured with #rmagical #rsafeguards. However, you recognize them, and know that they can be tricked by exchanging another #grelic #gof #gsimilar #gvalue, or a #ypile #yof #ygold. You look at what you have on hand....",
      "You hold you breath as you carefully switch your new offering for the relic. When nothing happens, you breathe a sigh of relief and quickly leave with your prize.",
      "The temple is sinister enough that you decide to continue on your journey without disturbing it."
    ],
    "OPTIONS": [
      "[Relic] #gGain {0}. #rLose {1}.",
      "[Gold] #gGain {0}. #rLose #r{1} #rGold.",
      "[Locked] Requires {0} Gold.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:AncientLaboratory": {
    "NAME": "Ancient Laboratory",
    "DESCRIPTIONS": [
      "An ancient alchemist's laboratory! Unfortunately, you quickly conclude that almost all of it is worthless. All these items were drained of power long ago. One relic, however, seems to have twisted and reformed, gaining new power from #pcorruption. It would make a fine addition to your arsenal. NL NL Alternatively, perhaps there's #bsomething #belse to be found if you rummage through this mess?",
      "No need to go looking for something else when you have a valuable find right here in front of you. The corruption #rburns a bit when you pick up the relic.",
      "Success! Deep within the laboratory, underneath a pile of worthless junk, you find a relic! You also picked up a few bruises from digging through all that."
    ],
    "OPTIONS": [
      "[Corruption] #gGain {0}. #rLose #r{1} #rHP.",
      "[Rummage] #gGain #ga #grelic. #rLose #r{0} #rHP.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:ForbiddenLibrary": {
    "NAME": "Forbidden Library",
    "DESCRIPTIONS": [
      "Hidden away amidst vast ruins, you find what used to be a #blibrary. It must have been abandoned and looted long ago. Perhaps that was for the best, since the few remaining books speak of #ppowers #pbeyond #pmortal #pimagining, and detail myriad ways to tap into them. NL NL Continuing to read will give you dangerous but useful #gknowledge. If you don't spend your time reading, you could #grest here; it's so remote that it will be very safe.",
      "The books speak of a play that drives any reader mad by the second act, which shares its name with its horrific master. Terrifying.",
      "The books tell of a being older than the world who lies dreaming beneath the ocean, waiting for when the stars are right. Chilling.",
      "The books advise of a fertility deity who births hideous tentacled young, worshipped by vast multitudes who seek her favor. Sickening.",
      "For a ruined library of corrupted magic, it's a pretty comfortable place to sleep. You wake up ~very~ refreshed."
    ],
    "OPTIONS": [
      "[Study] #gChoose #g1 #gof #g{0} #gcorrupted #gcards #gto #gadd #gto #gyour #gdeck.",
      "[Rest] #gHeal #g{0} #gHP.",
      "[Leave]",
      "Add a card to your deck."
    ]
  },
  "CorruptTheSpire:WorldsUponWorlds": {
    "NAME": "Worlds Upon Worlds",
    "DESCRIPTIONS": [
      "Suddenly you can see them. All the worlds, thousands and thousands of them, floating like bubbles. Worlds of #glife and #ylaughter, of #rhunger and #rfear, of #bclouds and of #boceans, of #gforests and of #bstone. NL NL They pass by in a never-ending stream, just beyond your reach. You stand there for what seems like hours, captivated by the fascinating display.",
      "Eventually you realize that three bubbles have drifted closer, close enough that you could reach out and touch them. NL NL One is a world #bfull of #ycolor and #glife of all forms. NL The second is peaceful, silent, serene. NL The third is overrun with #pcorruption, a bubble about to #rburst.",
      "Scenes from the world within the bubble pass through your mind, too fast to recognize or remember. But you keep with you a different way of thinking, a boon, a hint of the world you briefly touched... before your vision of the bubbles vanishes. NL NL You focus once more on your quest. The #bSpire must be conquered. The memory of what you saw slowly fades...."
    ],
    "OPTIONS": [
      "[Continue]",
      "[First] #gGain {0}. #gReduce #gCorruption #gby #g{1}.",
      "[Second] #gRemove #ga #gcard #gfrom #gyour #gdeck.",
      "[Third] #gAdd #ga #gcorrupted #gcard #gto #gyour #gdeck.",
      "[Leave]",
      "Select a Card to Remove."
    ]
  },
  "CorruptTheSpire:CorruptedShrine": {
    "NAME": "Corrupted Shrine",
    "DESCRIPTIONS": [
      "The ancient altar before you is suffused with a dark, corrupted energy. The entity this place is consecrated to offers great power.",
      "You beseech the entity for power, and are given it.",
      "You pray to the entity for its blessing, and are granted it.",
      "You leave the shrine alone."
    ],
    "OPTIONS": [
      "[Beseech] #gAdd #g{0} #gcorrupted #gcards #gto #gyour #gdeck.",
      "[Pray] #gDuplicate #ga #gcard #gin #gyour #gdeck.",
      "[Leave]",
      "Select a Card to Duplicate."
    ]
  },
  "CorruptTheSpire:Messenger": {
    "NAME": "Messenger",
    "DESCRIPTIONS": [
      "The voice makes no sound, reaching directly into your mind. \"We come to you a #ymessenger. We know of your eternal climb.\" NL NL \"We wish to say: not all that lies beyond is #pdarkness. There are places of #border as well, and #gbeauty. There are those who watch your struggle with compassion.\" NL NL \"If you wish, we would give you some of our #rwarmth, in exchange for some of your own.\"",
      "\"Good. We give you our ~blessing.~ All shall find the light at last.\"",
      "\"Very well. Then until this time comes again, farewell.\""
    ],
    "OPTIONS": [
      "[Accept] #gGain {0}. #rLose #r{1} #rMax #rHP.",
      "[Decline]",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:BlessingsOfChaos": {
    "NAME": "Blessings of Chaos",
    "DESCRIPTIONS": [
      "~\"again~ ~YOU~ ~must~ ~CHOOSE~ ~a~ ~BLESSING.\"~ NL NL ~\"bLeSsInG~ ~BlEsSiNg~ ~BLEssiNG~ ~bleSSIng.~ ~CHooSE~ ~cHoOsE~ ~ChOoSe~ ~chOOse.~ ~you~ ~YOU~ ~yOu~ ~YoU.\"~",
      "\"ha #bHA #rha #yHa #pha #gHA hA #yHA #pHA #gha #rha #bHA #yha Ha #rhA #gHA #bhA ha #pHA #bha #rhA.\"",
      "#r\"HA #bha #pHA hA #bHA #gha #rHa ha #yha #bHA #rHA #gha #pHA #yhA Ha #gha #pHa #yHA #rha #bHA Ha.\"",
      "#p\"NO #pno #pNo #pnO #pno #pNo #pnO #rNO #rnO #rNO #rno #rNo #rNo #rnO #rno #rNO.\""
    ],
    "OPTIONS": [
      "[Power] #gGain {0}.",
      "[Glory] #gGain {0}.",
      "[Decline] #rLose #r{0} #rHP.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:GoldenVision": {
    "NAME": "Golden Vision",
    "DESCRIPTIONS": [
      "A vision of a land of #ygold. Majestic, beautiful, lifeless. NL NL Something ~made~ it this way. A #bman. A #bking. A #gblessing that was also a #pcurse, brought down upon the land by #rgreed. NL NL Grasp the power, and it could be yours.",
      "The #ypower #g@floods@ through you, and for a moment your vision is overwhelmed by a #g~golden~ #g~radiance.~ NL NL As your vision returns, you can feel the #ypower settle within you, bringing with it the mad king's #pcurse.",
      "You ignore the vision, and it soon fades, vanishing into memory just as the great kingdom itself did."
    ],
    "OPTIONS": [
      "[Grasp] #gGain {0}. #rLose {1}.",
      "[Ignore]",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:FutureSight": {
    "NAME": "Future Sight",
    "DESCRIPTIONS": [
      "As you look ahead, your perception of the Spire becomes... ~distorted.~ Your sight is filled with something entirely different, a #btorrent of images that you gradually understand show your own future in the Spire. NL NL By concentrating on the images you may learn of your destiny, but to meddle with #pfate is to invite #rdoom.",
      "You focus on a key moment: the #gpowerful #grelics you will find after defeating a deadly foe. In a flash of insight, you understand that parts of your future are #palready #pdetermined, set by forces beyond your control. But you have a chance to #gchange that by replacing the future you see with a different one... though you won't be able to control what the new future is. NL NL Focusing again on the #yrelics, you see that your choice will be between {0}, {1}, and {2}.",
      "You reach out your hand and #r@thrust@ away the image you saw, exerting your influence upon the fates through #bsheer #bwillpower, insisting that the chest in the image is not what you will find. NL NL As the image crumbles, a different image of a chest takes it place, and you revel in #gtriumph. NL NL Yet your triumph is tempered by a deep feeling of unease. You have meddled with #p~forces~ #p~beyond~ #p~mortal~ #p~knowledge.~ Will your hubris be your #rdoom?",
      "Having seen what will come is enough. NL NL You ease your concentration and let the images dissolve, thinking of the #ytreasure you will find.",
      "You close your eyes to shut out the confusing mess of the future. NL NL When you open them again, you see the Spire of the present in front of you once more."
    ],
    "OPTIONS": [
      "[Concentrate] #gPreview #gand #goptionally #gchange #gthe #gnext #gboss #grelics. #rGain {0}.",
      "[Close your eyes]",
      "[Change] #gRandomize #gthe #grelics #gin #gthe #gnext #gboss #gchest. #rGain #r{0} #rCorruption.",
      "[Accept] Do not change the relics in the next boss chest.",
      "[Leave]"
    ]
  }
}