{
  "CorruptTheSpire:FragmentOfCorruption": {
    "NAME": "Fragment of Corruption",
    "DESCRIPTIONS": [
      "As you wander the corrupted passages of the Spire, you notice a small piece of #bSpirestone that's broken off from the wall. It looks like the combination of #pcorruption and #bSpirestone has #gcrystallized. NL NL Doesn't look like there's any danger to touching it, so you scoop it up as you pass by."
    ],
    "OPTIONS": [
      "[Continue] Gain a {0} and continue on."
    ]
  },
  "CorruptTheSpire:TheChoice": {
    "NAME": "The Choice",
    "DESCRIPTIONS": [
      "A crossroads. A #yfigure, cloaked. It beckons to you. NL NL The corruption within you urges you onward, promises you life, power, the world. You need only embrace it.",
      "The #yfigure murmurs with satisfaction as the #pcorruption surges within and around you. It hums through your #rveins, in #gharmony with the song of the #bSpire's corruption. How foolish it would be to deny yourself this power.",
      "The #yfigure advances, hissing and angry. The #pcorruption will not be thwarted so easily. If the siren's song does not suffice, perhaps force will. NL NL Reaching within yourself, knowing more is needed, you take the part of yourself that the phantasm seeks to seduce and #r@rip@ it out. NL NL The phantasm wails as you stand firm and resolute before it. It has no power over you now, and you stride forward, leaving it behind."
    ],
    "OPTIONS": [
      "[Embrace] #gGain #ga #grelic #gand #gupgrade #g{0} #grandom #gcards. #rGain #r{1} #rCorruption.",
      "[Reject] #gReduce #gCorruption #gby #g{0}. #rLose {1}.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:NightmareBloom": {
    "NAME": "Nightmare Bloom",
    "DESCRIPTIONS": [
      "As you cross an area of deep corruption within the Spire, your nightmares suddenly begin to feel very... #p~real...~. NL NL Fantasies of #gpower and #bskill surround you. NL You see now. The power could be yours. What do you reach out and seize?",
      "A minor exchange. NL NL As the visions dissipate, you feel a faint... disappointment. You could have had so much more.",
      "Might and mastery fill you. NL NL The corruption around you beckons you forward, and in its swirls and tendrils, there is satisfaction.",
      "The deal is made. You will purchase power, and gold will arm and armor you. NL NL Let the corruption grow. You will reap it for wealth and glory."
    ],
    "OPTIONS": [
      "[Earthly Goods] #gObtain {0}. #pGain #p{1} #pCorruption.",
      "[Heroic Power] #gUpgrade #gall #gCards. #pGain #p{0} #pCorruption.",
      "[Grand Wealth] #gGain #g{0} #gGold. #pGain #p{1} #pCorruption.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:MindsEye": {
    "NAME": "Mind's Eye",
    "DESCRIPTIONS": [
      "Your thoughts turn inward, and the Spire disappears as you explore your own #bmind. Strange, shimmering #gideas bubble up from within, reflecting back and forth in your mind's eye. NL NL You could be doing everything so very differently, you're sure of it. You strain your mind, feeling that an #gepiphany lies just beyond these phantasms....",
      "Of course. The countless ascents. Different bodies, yet one spirit. NL NL Come from below. Rise unto the heights, descend again with knowledge.",
      "You close your mind to the ideas. You won't be tricked. Your mind is a fortress."
    ],
    "OPTIONS": [
      "[Epiphany] #gGain {0}.",
      "[Reject] #gGain {0}.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:AStepToTheSide": {
    "NAME": "A Step to the Side",
    "DESCRIPTIONS": [
      "~Confused,~ you look around. Smoke drifts through the air. You're not sure how you got here.... NL NL A voice focuses your attention. \"Oh ho, a visitor. And by the looks of it, another one from that #bSpire.\" An old woman stands before you, tools of fortune telling in her hands. NL NL \"Nothing can change the #pfate you're yoked to, my dear, but perhaps I can ease you on your way.\" What do you ask for?",
      "The woman hands you a #gdeck #gof #gcards. \"There, a guide to aid you, only slightly #pcursed. Don't worry, it's a gift. I have other decks, and many other devices besides. Concern yourself with your own fate, climbing that #bSpire.\" NL NL You blink, and the woman fades away. The twisting passages of the #bSpire surround you, warped and alien. You begin to climb once more....",
      "A single card is all the woman lays out. A #ywheel, with figures surrounding it. You can't see the name of the card through the smoke. NL NL As you step forward to take a closer look, everything fades away. NL NL What just happened? You shake the fog from your thoughts and pick up the small pile of #ygold in front of you before continuing."
    ],
    "OPTIONS": [
      "[The Deck] #gGain {0}. #rBecome #rCursed #r- #rgoes #raway #rin #r{1} #rcombats.",
      "[A Drawing] #gGain #g{0} #gGold.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Wheel": {
    "NAME": "Wheel",
    "DESCRIPTIONS": [
      "Seeing a #ycard in front of you, you stop in your tracks. You can't pinpoint why, but something is familiar about it. NL NL Perhaps you've seen it before... or will see it, or were someone who saw it, or will be someone who sees it. NL NL The longer you try to think about it, the more your head #rhurts. But if you believe that somewhere out there, someone is sympathetic to your quest, this card might be a #gboon.",
      "You touch the card. For a moment, there are more directions to the world than normal. You see #ryourself and #gyourself and #byourself and #pyourself, and know that even that is only a small part of the whole. NL NL Vision or hallucination? You aren't sure. You take the card with you, hoping that its power will smooth your path.",
      "You resist the temptation to touch the card. You will win free of this place using your own power."
    ],
    "OPTIONS": [
      "[Touch the Card] #gGain {0}.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:Divergence": {
    "NAME": "Divergence",
    "DESCRIPTIONS": [
      "The #bSpire is quiet around you. For once, nothing threatening seems to be nearby. NL NL This is a perfect opportunity to engage in self-study and training improve your strength in combat. There are two ways you could approach this: #gfocus on what you already know and build on it, or #gbroaden your horizons in search of something new and different.",
      "The technique fits well with what you already know.",
      "How do you know all these strange things anyway? Do you learn them or... remember them?"
    ],
    "OPTIONS": [
      "[Focus] #gChoose #g1 #gof #g{0} #gcards #gto #gadd #gto #gyour #gdeck.",
      "[Broaden] #gChoose #g1 #gof #g{0} #gcards #gof #gany #gcolor #gto #gadd #gto #gyour #gdeck.",
      "[Leave]",
      "Add a card to your deck."
    ]
  },
  "CorruptTheSpire:PathsInTheSmoke": {
    "NAME": "Paths in the Smoke",
    "DESCRIPTIONS": [
      "#pThick #pblack #psmoke billows all around you, coming from an unseen source. In front of you, the thick strands of smoke fuse into a masked form. NL NL ~\"You~ aren't supposed to be ~here.~ If you keep wandering around untethered like this, you'll disrupt @everything.@ Neow needs to keep a tighter #rleash.\" NL NL \"I'll send you on your way, and I'll even let you choose where you end up. Just go, ~quickly.\"~",
      "At the figures gesture, three paths materialize from the smoke. Each one leads to an interesting location in the Spire. You step onto the path towards...."
    ],
    "OPTIONS": [
      "[Continue]"
    ]
  },
  "CorruptTheSpire:IncantationOfCorruption": {
    "NAME": "Incantation of Corruption",
    "DESCRIPTIONS": [
      "Examining a scroll you found, you sense that it holds the power of #r~chaos~ and #r~corruption.~ From the runes and diagrams, using the scroll will give you some of that power. NL NL The cost, or downside, seems to only be that using the power it gives is likely to further increase the #rcorruption.",
      "You speak the incantation to trigger the scroll, and a #proiling #pmass #pof #pshadows surrounds you, consuming and replacing your armor. The power it brings with it is... #rdelightful. NL NL\tYou will fight corruption with corruption. Victory is all that matters.",
      "Rather than make use of the scroll, you drain its energy. It's not much, but after absorbing all of it, you feel more #grobust."
    ],
    "OPTIONS": [
      "[Use] #gTransform #gyour #gDefends #ginto #gcorrupted #gcards.",
      "[Disenchant] #gGain #g{0} #gMax #gHP.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:StrangeMarketplace": {
    "NAME": "Strange Marketplace",
    "DESCRIPTIONS": [
      "Between one step and the next, you find yourself on the edges of a #gmarketplace, shrouded in shadows and dust. All sorts of mundane and magical goods are being sold, though the offerings are a bit #pstrange compared to what you're used to. NL NL Browsing, you find something that looks like quite a #ybargain.",
      "You hand over your #ygold and take the relic, and with your next step you find yourself in the #bSpire once more.",
      "You turn to leave without buying anything, and with your next step you find yourself in the #bSpire once more."
    ],
    "OPTIONS": [
      "[Buy] #gGain {0}. #rLose #r{1} #rGold.",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:TreeOfSwords": {
    "NAME": "Tree of Swords",
    "DESCRIPTIONS": [
      "You stand before a tree with many weapons driven into its trunk and the ground around it. Alongside the weapons, you see the long-dead remains of what must be previous adventurers. They either came here to die, or were brought here. NL NL Some of the #bequipment here could come in handy, you see what might be a #grelic, and there are many #ycoins scattered about.",
      "You take armor and weaponry from the fallen warriors, leaving some of your own behind in tribute. You know they would accept the trade if their spirits could speak. After all, you and they share the same doomed quest.",
      "It looks like two fallen warriors were put to rest in the same spot here. Out of the remnants of their power, a relic formed as their bequest to the next to attempt this climb. Respectfully, you take the relic, leaving behind your own memento.",
      "You gather up all the coins. It's hard to avoid all the sharp weapons around them, though, so you get cut a few times."
    ],
    "OPTIONS": [
      "[Equipment] #gTransform #g{0} #gcards #ginto #gcards #gof #gany #gcolor.",
      "[Relic] #gGain {0}. #rLose {1}.",
      "[Coins] #gGain #g{0} #gGold. #rLose #r{1} #rHP.",
      "[Leave]",
      "Select Cards to Transform."
    ]
  },
  "CorruptTheSpire:WithoutBeginningOrEnd": {
    "NAME": "Without Beginning or End",
    "DESCRIPTIONS": [
      "Ahead of you, you see a figure approach a #gjeweled #yidol on a platform. Suddenly, a trap door opens and a boulder rolls out! But something nudges the boulder out of the way, and the figure escapes unharmed, with the idol.",
      "You approach a #gjeweled #yidol on a platform. Suddenly, a trap door opens and a boulder rolls out! But something nudges the boulder out of the way, and you escape unharmed, with the idol.",
      "Behind you, you see a figure approach a #gjeweled #yidol on a platform. Suddenly, a trap door opens and a boulder rolls out! You could throw the idol you have in your hands to nudge the boulder out of the way, but you'd lose the idol, and you're certain you could sell it.",
      "You throw the  idol to nudge the boulder out of the way, and the figure escapes unharmed, with the idol. NL NL You spend the next few minutes thinking about how to apply that as a #bcombat #bmaneuver.",
      "You ignore the boulder and quickly sell the #gjeweled #yidol to a passing trader. Somehow, you feel that was #runwise."
    ],
    "OPTIONS": [
      "[Throw] #gGain #g{0} {1}.",
      "[Turn Away] #gGain #g{0} #gGold. #rBecome #rCursed #r- #rFated.",
      "[Continue]",
      "[Leave]"
    ]
  },
  "CorruptTheSpire:UnderAStrangeSky": {
    "NAME": "Under a Strange Sky",
    "DESCRIPTIONS": [
      "Suddenly terrible cold and an unfamiliar sky assail you. Seeking shelter, you enter the ice-covered structure in front of you. It appears to be ancient and abandoned, with little inside except more ice. NL NL The only intact thing you find is a shield, #gshimmering as it hangs on a high wall. Nearby is an old #rfire #rpit that you could get going again and rest next to. And in the depths, far enough down that it looks even colder than the rest of this place, you see a faint #yglint that might be a valuable relic.",
      "After a careful climb, you reach the #gshield. You feel its energy flow into you as you take it; the cold of this place no longer feels as harsh.",
      "You rest by the #rfire you created. In the coals, you find some #punusual #pfragments that you decide to take with you.",
      "The depths are #b~terribly~ #b~cold.~ The #yrelic is where you thought it was, but you can feel the chill in your bones. There will be a #rprice #rto #rpay for this."
    ],
    "OPTIONS": [
      "[Shield] #gGain {0}. #gGain #g{1} #gMax #gHP.",
      "[Fire Pit] #gGain #g{0} {1}. #gHeal #g{2} #gHP.",
      "[Depths] #gGain #ga #grelic. #rLose #r{0} #rMax #rHP.",
      "[Leave]"
    ]
  }
}